In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data={'company':['GOOGLE',"GOOGLE",'MSFT','MSFT','FB','FB'],
     'Person':['JATIN','SHARD','AMIT','CHANCHAL','SIDDHARRH','MANOJ'],'SALES':[22,22,222,2222,2122,2]}

In [4]:
data

{'company': ['GOOGLE', 'GOOGLE', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['JATIN', 'SHARD', 'AMIT', 'CHANCHAL', 'SIDDHARRH', 'MANOJ'],
 'SALES': [22, 22, 222, 2222, 2122, 2]}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

  company     Person  SALES
0  GOOGLE      JATIN     22
1  GOOGLE      SHARD     22
2    MSFT       AMIT    222
3    MSFT   CHANCHAL   2222
4      FB  SIDDHARRH   2122
5      FB      MANOJ      2

In [8]:
bc=df.groupby('company')

In [9]:
bc.sum()

         SALES
company
FB        2124
GOOGLE      44
MSFT      2444

In [10]:
bc.mean()

         SALES
company
FB        1062
GOOGLE      22
MSFT      1222

In [11]:
bc.std()

               SALES
company
FB       1499.066376
GOOGLE      0.000000
MSFT     1414.213562